Revit 2027 API
ImageExportOptions.SetViewsAndSheets Method
 Sets a list of views and sheets to be exported. Used only when ExportRange is SetOfViews.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetViewsAndSheets(
	IList<ElementId> viewsAndSheets
)
Public Sub SetViewsAndSheets (
	viewsAndSheets As IList(Of ElementId)
)
public:
void SetViewsAndSheets(
	IList<ElementId^>^ viewsAndSheets
)
member SetViewsAndSheets :
        viewsAndSheets : IList<ElementId> -> unit
Parameters
viewsAndSheets IList<ElementId>
 The ids of the views and sheets.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ImageExportOptions Class
Autodesk.Revit.DB Namespace